app/controllers/brands_controller.rb

	def index
	  @search = Brand.search do
---
SELECT  "brands".* FROM "brands"  ORDER BY "brands"."id" ASC LIMIT 1

	def create
		@brand = Brand.new(brand_params)
		if @brand.save
---
INSERT INTO "brands" ("name", "item", "size", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "audi"], ["item", "a3"], ["size", "q8"], ["category_id", 4], ["created_at", "2016-01-25 21:12:50.615600"], ["updated_at", "2016-01-25 21:12:50.615600"]]

	def update
		binding.pry
		if @brand.update_attributes(brand_params)
---
UPDATE "brands" SET "item_code" = $1, "category_id" = $2, "updated_at" = $3 WHERE "brands"."id" = $4  [["item_code", nil], ["category_id", 8], ["updated_at", "2016-02-28 08:56:54.999860"], ["id", 27]]

	def destroy
		if @brand
			@brand.destroy
---
DELETE FROM "brands" WHERE "brands"."id" = $1  [["id", 3]]

	def find_brand
		@brand = Brand.find(params[:id])
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT 1  [["id", 8]]