app/controllers/brands_controller.rb

SELECT  "brands".* FROM "brands"  ORDER BY "brands"."name" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "brands"
---
	def index
		@brands = Brand.order(:name).page params[:page]