app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"  ORDER BY id asc
---
	def index
      @categories = Category.all

INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "make"], ["description", "take"], ["created_at", "2016-01-24 11:53:32.398246"], ["updated_at", "2016-01-24 11:53:32.398246"]]
---
	def create
	  @category = Category.new(category_params)
	  if @category.save

UPDATE "categories" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "categories"."id" = $4  [["name", "save"], ["description", "this some description"], ["updated_at", "2016-01-25 13:20:55.509545"], ["id", 3]]
---
	def update
	  if @category.update_attributes(category_params)

DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 5]]
---
	def destroy
		if @category
			@category.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 5]]
---
	def find_category
	  @category = Category.find(params[:id])