app/controllers/incomings_controller.rb

	def index
		@incomings = Incoming.all
---
SELECT "incomings".* FROM "incomings"

	def create
		@incoming = Incoming.new(incoming_params)
		if @incoming.save!
---
INSERT INTO "incomings" ("quantity", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["quantity", 10], ["brand_id", 27], ["created_at", "2016-02-28 22:00:06.476252"], ["updated_at", "2016-02-28 22:00:06.476252"]]