app/controllers/outgoings_controller.rb

SELECT "outgoings".* FROM "outgoings"
---
	def index
		@outgoings = Outgoing.all

INSERT INTO "outgoings" ("quantity", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["quantity", 1.0], ["brand_id", 27], ["created_at", "2016-03-09 18:12:16.481333"], ["updated_at", "2016-03-09 18:12:16.481333"]]
---
	def create
		@outgoing = Outgoing.new(outgoing_params)
		if @outgoing.save!