app/views/brands/_form.html.haml

SELECT "categories".* FROM "categories"  ORDER BY id asc
---
= f.collection_select :category_id, Category.all, :id, :name, {prompt: "Select a category"}, {class: "form-control"}